/* Details of a saved card. &apos;{card brand} ending in {last 4}&apos; e.g. &apos;VISA ending in 4242&apos; */
"%1$@ ending in %2$@" = "%1$@ kết thúc bằng %2$@";

/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@ - Ngoại tuyến";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"+ Add" = "+ Thêm";

/* Text for a button that, when tapped, displays another screen where the customer can enter card details */
"+ Add card" = "+ Thêm thẻ";

/* Source type brand name */
"3D Secure" = "Bảo mật 3D";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "ĐỊA CHỈ CHỦ TÀI KHOẢN";

/* This is a Payment Method type brand name so shouldn&apos;t be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "Ghi nợ AU BECS";

/* part of {Account} ending in {last4} */
"Account" = "Tài khoản";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Tên chủ tài khoản";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "Số tài khoản";

/* Button to add a new credit card. */
"Add New Card…" = "Thêm thẻ mới...";

/* Title for Add a Card view */
"Add a Card" = "Thêm thẻ";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Thêm tài khoản Ghi nợ Trực tiếp";

/* Title shown above a card entry form */
"Add a card" = "Thêm một thẻ";

/* Label of a button displayed below a card entry form that saves the card details */
"Add card" = "Thêm thẻ";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"Add new payment method" = "Thêm phương thức thanh toán mới";

/* Title shown above a form where the customer can enter payment information like credit card details, email, billing address, etc. */
"Add your payment information" = "Thêm thông tin thanh toán của bạn";

/* Address line 2 placeholder for billing address form. */
"Address line 2 (optional)" = "Dòng địa chỉ 2 (tùy chọn)";

/* Payment Method type brand name  */
"Afterpay" = "Afterpay";

/* Payment Method type brand name */
"AfterpayClearpay" = "AfterpayClearpay";

/* Payment Method type brand name */
"AfterpayClearpay_copy" = "AfterpayClearpay";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Căn hộ";

/* Title for bank picker section */
"BANK" = "NGÂN HÀNG";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "THÔNG TIN TÀI KHOẢN NGÂN HÀNG";

/* Title for billing address entry section */
"BILLING ADDRESS" = "ĐỊA CHỈ THANH TOÁN";

/* Payment Method type brand name */
"BLIK" = "BLIK";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* Text for back button */
"Back" = "Quay lại";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Tài khoản ngân hàng";

/* Title for billing address entry section */
"Billing Address" = "Địa chỉ thanh toán";

/* Billing address section title for card form entry. */
"Billing address" = "Địa chỉ thanh toán";

/* Payment Method type brand name */
"Boleto" = "Boleto";

/* Klarna buy now or pay later copy */
"Buy now or pay later with Klarna." = "Mua ngay hoặc thanh toán sau bằng Klarna.";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "Bằng việc cung cấp số IBAN và xác nhận thanh toán này, bạn đang cho phép %@ và Stripe - nhà cung cấp dịch vụ thanh toán - gửi hướng dẫn tới ngân hàng của bạn để ghi nợ vào tài khoản và ngân hàng đó ghi nợ tài khoản của bạn căn cứ theo hướng dẫn này. Bạn được quyền nhận tiền hoàn từ ngân hàng theo các điều khoản và điều kiện trong hợp đồng giữa bạn với ngân hàng đó. Yêu cầu hoàn tiền cần phải được lập trong vòng 8 tuần kể từ ngày tài khoản của bạn được ghi nợ.";

/* SEPA mandate text */
"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Bằng việc cung cấp thông tin thanh toán của quý vị và xác nhận khoản thanh toán này, quý vị đã ủy quyền cho (A) %@ và Stripe, nhà cung cấp dịch vụ thanh toán của chúng tôi, gửi hướng dẫn đến ngân hàng của quý vị để ghi nợ tài khoản của quý vị và (B) ngân hàng ghi nợ tài khoản của quý vị theo những hướng dẫn đó. Trong các quyền của mình, quý vị được hoàn tiền từ ngân hàng của mình theo các điều khoản và điều kiện trong thỏa thuận của quý vị với ngân hàng của quý vị. Khoản tiền hoàn phải được yêu cầu trong vòng 8 tuần kể từ ngày tài khoản của quý vị bị ghi nợ. Các quyền của quý vị được giải thích trong bản tuyên bố mà quý vị có thể nhận được từ ngân hàng của mình. Quý vị đồng ý nhận thông báo cho các khoản ghi nợ trong tương lai tối đa 2 ngày trước khi chúng xảy ra.";

/* Title for card number entry field */
"CARD" = "THẺ";

/* Title for contact info form */
"CONTACT" = "LIÊN HỆ";

/* Title for country picker section */
"COUNTRY" = "QUỐC GIA";

/* Label for entering CVC in text field */
"CVC" = "CVC";

/* Label for entering CVV in text field */
"CVV" = "CVV";

/* Button title to cancel action in an alert */
"Cancel" = "Hủy";

/* Title for credit card number entry field */
"Card" = "Thẻ";

/* Details of a saved card */
"Card ending in %@" = "Thẻ kết thúc bằng %@";

/* Card details entry form header title */
"Card information" = "Thông tin thẻ";

/* Label for card number entry text field */
"Card number" = "Số thẻ";

/* TODO */
"Choose a payment method" = "Chọn phương thức thanh toán";

/* Payment Method type brand name */
"Clearpay" = "Clearpay";

/* Accessibility label for the button to close the card scanner. */
"Close card scanner" = "Đóng máy quét thẻ";

/* Title for contact info form */
"Contact" = "Liên hệ";

/* Text for continue button */
"Continue" = "Tiếp tục";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "ĐỊA CHỈ GIAO HÀNG";

/* Title for delivery info form */
"Delivery" = "Giao hàng";

/* Title for delivery address entry section */
"Delivery Address" = "Địa chỉ giao hàng";

/* Source type brand name */
"EPS" = "EPS";

/* Button title to enter editing mode */
"Edit" = "Sửa";

/* Payment Method type brand name */
"FPX" = "FPX";

/* Label for free shipping method */
"Free" = "Miễn phí";

/* Placeholder string for name entry field. */
"Full name" = "Họ tên";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"GrabPay" = "GrabPay";

/* IBAN placeholder – don&apos;t translate */
"IBAN" = "IBAN";

/* Shipping form error message */
"Invalid Shipping Address" = "Địa chỉ vận chuyển không hợp lệ";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Dữ liệu không hợp lệ.";

/* Source type brand name */
"Klarna" = "Klarna";

/* Link Payment Method type brand name */
"Link" = "Link";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Đang tải...";

/* label for text field to enter card expiry */
"MM / YY" = "Tháng /Năm";

/* label for text field to enter card expiry */
"MM/YY" = "Tháng/Năm";

/* Title for payment options section */
"MORE OPTIONS" = "THÊM TÙY CHỌN";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Payment Method type brand name */
"NetBanking" = "Ngân hàng trực tuyến";

/* Label for button to add a new credit or debit card */
"New Card" = "Thẻ mới";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Tài khoản Ghi nợ trực tiếp mới";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Tài khoản Ghi nợ trực tiếp SEPA mới";

/* Button to move to the next text entry field */
"Next" = "Tiếp";

/* No comment provided by engineer. */
"OK" = "OK";

/* Payment Method type brand name */
"OXXO" = "OXXO";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Ngân hàng Trực tuyến (FPX)";

/* Title of a section containing multiple payment methods that can selected and will collect the payment information from the user. */
"Or pay using" = "Hoặc thanh toán bằng";

/* Title of a section containing a card form that will collect the payment information from the user. */
"Or pay with a card" = "Hoặc thanh toán bằng thẻ";

/* An option in a dropdown selector indicating the customer's desired selection is not in the list. e.g., 'Choose your bank: Bank1, Bank2, Other' */
"Other" = "Khác";

/* Source type brand name */
"P24" = "P24";

/* Label of a button that initiates payment when tapped */
"Pay %@" = "Thanh toán %@";

/* Klarna pay later copy */
"Pay later with Klarna." = "Thanh toán sau bằng Klarna.";

/* Pay with {payment method} */
"Pay with %@" = "Thanh toán bằng %@";

/* Payment Method type brand name */
"PayPal" = "PayPal";

/* Title for Payment Method screen */
"Payment Method" = "Phương thức thanh toán";

/* Caption for Phone field on address form */
"Phone" = "Điện thoại";

/* Accessibility instructions for card scanning. */
"Point the camera at your card." = "Hướng camera vào thẻ.";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "Bưu điện";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Mã bưu điện";

/* Label of a button that, when tapped, initiates payment, becomes disabled, and displays this text */
"Processing..." = "Đang xử lý...";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Button title for confirmation alert to remove a saved payment method
   Text for remove button */

"Remove" = "Xóa";
/* Content for alert popup prompting to confirm removing a saved card. Remove {card brand} ending in {last 4} e.g. &apos;Remove VISA ending in 4242&apos; */

"Remove %1$@ ending in %2$@" = "Xóa thẻ %1$@ kết thúc bằng %2$@";
/* Content for alert popup prompting to confirm removing saved payment method. */

"Remove %@" = "Xóa %@";
/* Title for confirmation alert to remove a card */

"Remove Card" = "Xóa thẻ";
/* Title for confirmation alert to remove a saved bank account payment method */

"Remove bank account" = "Bỏ tài khoản ngân hàng";
/* Content for alert popup prompting to confirm removing a saved bank account. e.g. 'Remove bank account ending in 4242' */

"Remove bank account ending in %@" = "Bỏ tài khoản ngân hàng có các số cuối là %@";
/* part of {SEPA Account} ending in {last4} */

"SEPA Account" = "Tài khoản SEPA";
/* Payment method brand name */

"SEPA Debit" = "Ghi nợ SEPA";
/* Source type brand name */

"SEPA Direct Debit" = "Ghi nợ trực tiếp SEPA";
/* Title for shipping address entry section */

"SHIPPING ADDRESS" = "ĐỊA CHỈ VẬN CHUYỂN";
/* Label for shipping method form */

"SHIPPING METHOD" = "PHƯƠNG THỨC VẬN CHUYỂN";
/* Source type brand name */

"SOFORT" = "SOFORT";
/* The label of a switch indicating whether to save the payment method for future payments. */

"Save for future payments" = "Tiết kiệm cho các khoản thanh toán trong tương lai";
/* The label of a switch indicating whether to save the user&apos;s card for future payments to this merchant */

"Save this card for future %@ payments" = "Lưu thẻ này để thanh toán nhanh %@ sau này";
/* The label of a switch indicating whether to save the user's card for future payment */

"Save this card for future Stripe payments" = "Lưu thẻ này để thanh toán Stripe sau này";
/* Label of a button displayed below a payment method form. Tapping the button closes the form and uses the entered payment method details for checkout in the next step */

"Select" = "Chọn";
/* label for iDEAL-bank selection picker */

"Select bank" = "Chọn ngân hàng";
/* Title shown above a carousel containing the customer&apos;s payment methods */

"Select your payment method" = "Chọn phương thức thanh toán của bạn";
/* Label of a button displayed below a payment method form. Tapping the button sets the payment method up for future use */

"Set up" = "Cài đặt";
/* Title for shipping info form */

"Shipping" = "Vận chuyển";
/* Title for shipping address entry section */

"Shipping Address" = "Địa chỉ vận chuyển";
/* Label for shipping method form */

"Shipping Method" = "Phương thức vận chuyển";
/* Payment Method type brand name

   Source type brand name */
"Sofort" = "Sofort";

/* Caption for generalized state/province/region field on address form (not tied to a specific country&apos;s format) */
"State / Province / Region" = "Tiểu bang/Tỉnh/Khu vực";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "BSB mà bạn nhập chưa đầy đủ.";

/* Error string displayed to user when they enter in an invalid BSB number. &quot;BSB&quot; refers to an Australian bank account. */
"The BSB you entered is invalid." = "BSB mà bạn nhập không hợp lệ.";

/* An error message displayed when the customer's IBAN is incomplete. */
"The IBAN you entered is incomplete." = "IBAN quý vị đã nhập chưa đầy đủ.";

/* An error message displayed when the IBAN country code is not supported. */
"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "IBAN quý vị đã nhập không hợp lệ, \"%@\" không phải là mã quốc gia được hỗ trợ.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "Hiện không có phương thức thanh toán mà bạn chọn.";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Đã hết thời gian xác thực phương thức thanh toán -- hãy thử lại sau";

/* Error when the user hasn&apos;t allowed the current app to access the camera when scanning a payment card. &apos;Settings&apos; is the localized name of the iOS Settings app. */
"To scan your card, allow camera access in Settings." = "Để quét thẻ của bạn, hãy cho phép truy cập camera trong mục Cài đặt.";

/* Payment Method type brand name */
"UPI" = "UPI";

/* Default missing source type label */
"Unknown" = "Không biết";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Sử dụng Hóa đơn";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Sử dụng Giao hàng";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Chọn Vận chuyển";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Chúng tôi không thể xác thực phương thức thanh toán của bạn. Vui lòng chọn phương thức thanh toán khác và thử lại.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You&apos;ll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Bạn sẽ được điều hướng tới %@ để hoàn tất việc mua hàng.";

/* An error message displayed when the IBAN does not start with a two-letter country code. */
"Your IBAN should start with a two-letter country code." = "IBAN của quý vị phải bắt đầu bằng mã quốc gia gồm hai chữ cái.";

/* An error message. */
"Your IBAN should start with a two-letter country code._copy" = "IBAN của quý vị phải bắt đầu bằng mã quốc gia gồm hai chữ cái.";

/* Error message for when ZIP code in form is incomplete (US only) */
"Your ZIP is incomplete." = "Mã ZIP chưa đầy đủ.";

/* Error message for when postal code in form is invalid (US only) */
"Your ZIP is invalid." = "Mã ZIP không hợp lệ";

/* Error message for card form when card number is incomplete */
"Your card number is incomplete." = "Số thẻ chưa đầy đủ.";

/* Error message for card form when card number is invalid */
"Your card number is invalid." = "Số thẻ không hợp lệ.";

/* Error message for card details form when expiration date isn&apos;t entered completely */
"Your card's expiration date is incomplete." = "Ngày hết hạn trên thẻ không hợp lệ.";

/* Error message for card details form when expiration date is invalid */
"Your card's expiration date is invalid." = "Ngày hết hạn trên thẻ không hợp lệ.";

/* String to describe an invalid month in expiry date. */
"Your card's expiration month is invalid." = "Tháng hết hạn trên thẻ của bạn không hợp lệ.";

/* String to describe an invalid year in expiry date. */
"Your card's expiration year is invalid." = "Năm hết hạn trên thẻ của bạn không hợp lệ.";

/* Error message for card entry form when CVC/CVV is incomplete. */
"Your card's security code is incomplete." = "Mã bảo mật trên thẻ chưa đầy đủ.";

/* Error message for card entry form when CVC/CVV is invalid */
"Your card's security code is invalid." = "Mã bảo mật trên thẻ không hợp lệ.";

/* Error message for when postal code in form is incomplete */
"Your postal code is incomplete." = "Mã bưu điện chưa đầy đủ.";

/* Error message for when postal code in form is invalid */
"Your postal code is invalid." = "Mã bưu điện không hợp lệ.";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Mã ZIP";

/* accessibility label for text field */
"card number" = "số thẻ";

/* Placeholder string for email entry field. */
"example@example.com" = "example@example.com";

/* accessibility label for text field */
"expiration date" = "Ngày hết hạn";

/* Payment Method type brand name. */
"giropay" = "giropay";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* iDEAL bank section title for iDEAL form entry. */
"iDEAL Bank" = "Ngân hàng iDEAL";

